# RegEx, або регулярний вираз, – це послідовність символів, яка утворює шаблон 
# пошуку.Регулярний вираз можна використовувати для перевірки, чи містить 
# рядок заданий шаблон пошуку.Python має вбудований пакет під назвою re, 
# який можна використовувати для роботи з регулярними виразами.
import re

#txt = "The rain in Spain." # тут не спрацьовую через крапку наприкінці речення
txt = "The rain in Spain"
x = re.search("^The.*Spain$", txt)

if x:
    print("Yes! We have a match!")
else:
    print("No match.")

# головні функції модуля re: findall(),search(),split(),sub(),match()
# Основи синтаксису (Спецсимволи)
# Щоб створювати шаблони, потрібно знати "мову" регулярних виразів:
# . — будь-який символ, крім нового рядка.
# \d — будь-яка цифра (0-9).
# \w — будь-яка буква, цифра або нижнє підкреслення.
# \s — пробіл, табуляція або перенос рядка.
# ^ — початок рядка.
# $ — кінець рядка.
# * — 0 або більше повторень.
# + — 1 або більше повторень.
# ? — 0 або 1 повторення.
# {n} — рівно n повторень.

# Прапорці (Flags) — це спеціальні параметри, які змінюють те, 
# як регулярний вираз інтерпретує рядок. Вони дозволяють ігнорувати 
# регістр (великі/малі літери), працювати з багаторядковим текстом тощо.
# У Python прапорці передаються як третій аргумент у 
# функції типу re.search(), re.findall() тощо.

# Спеціальні послідовності — це заздалегідь визначені комбінації 
# символів, що складаються зі зворотного слешу \ та літери. Вони 
# працюють як «короткі назви» для цілих груп символів.
# Замість того, щоб писати довгий перелік [0-9], ти просто 
# пишеш \d. Це робить шаблон компактним і зрозумілим.

# Основні спеціальні послідовності.Використовуються у 90% випадків:Послідовність
# \d   Digit: будь-яка цифра [0-9]                "3", "7"
# \D   НЕ цифра: будь-що, крім 0-9.               "A", "!", " "
# \w   Word: буква, цифра або _.                  "a", "Z", "5", "_"
# \W   НЕ буква/цифра: символи, пробіли.          "?", "#", " "
# \s   Space: пробіл, табуляція, новий рядок.     " ", \t, \n
# \S   НЕ пробіл: будь-який видимий символ.       "G", "8", "@"
# \b   Boundary: межа слова (початок або кінець)  Межа між пробілом і буквою

# Набір — це набір символів усередині пари квадратних дужок [] зі спеціальним значенням:
# Кількість наборів необмежена, тому що ти створюєш їх самостійно 
# під конкретне завдання. Квадратні дужки [] — це як конструктор: 
# ти кладеш туди ті символи, які тобі потрібні саме зараз.
# Однак усі набори можна розділити на чотири основні типи за логікою їхнього створення:

# 1. Перелічувальні набори (Прості).Ти просто записуєш символи 
# підряд. Порядок не має значення:
# [abc] — знайде "a", "b" або "c".
# [?!.;] — знайде будь-який із цих розділових знаків.
# [02468] — знайде будь-яку парну цифру.

# 2. Діапазони (Ranges):
# Щоб не писати весь алфавіт чи всі цифри, використовується дефіс -:
# a-z] — усі малі латинські літери.
# [а-яіїєґ] — усі малі українські літери (важливо додавати іїєґ окремо, бо в стандартний "а-я" вони іноді не входять).
# [0-9] — те саме, що й \d.
# [A-Z0-9] — будь-яка велика літера або цифра.

# 3. Заперечувальні набори (Negative sets):
# Використовують символ ^ на початку, щоб знайти все, чого немає в списку:
# [^0-9] — будь-що, крім цифр (літери, символи, пробіли).
# [^ \t\n] — будь-що, крім пробілів (аналог \S).

# 4. Комбіновані набори:
# Коли ти змішуєш діапазони та окремі символи:
# [a-zA-Z!?,] — будь-яка латинська літера або один із трьох знаків пунктуації.

# Чим набори відрізняються від "спеціальних послідовностей"?
# Це дуже важливий момент для розуміння:
# Послідовність.  \d.       Стандартна (тільки цифри).
# Набір.         [0-5]      Гнучка (тільки цифри від 0 до 5).
# Послідовність   \w.       Букви, цифри та _.
# Набір.         [a-z_].    Тільки малі літери та _.

# Використовуй послідовності (\d, \w, \s), коли тобі потрібні 
# стандартні групи (цифри, слова).

# Використовуй набори ([...]), коли тобі потрібно створити свій 
# унікальний список дозволених символів.

print('-----')

# функція findall(): повертає список, що містить усі збіги:
txt = "The rain in Spain"
x = re.findall("ai", txt)
print(x)

print('-----')

# список містить збіги в порядку їх знаходження.
# якщо збігів не знайдено, повертається порожній список:
txt = "The rain in Spain"
x = re.findall("Portugal", txt)
print(x)

print('-----')

# функція search():щукає збіг у рядку та повертає обʼєкт Match,
# якщо збіг є.Якщо знайдено більше одного збігу, буде повернуто перший екземпляр:
txt = "The rain in Spain"
x = re.search("\s", txt)
print(f'The first white-space character is located in position: {x.start()}')

print('-----')

# якщо збігів не знайдено,то функція повертає значення None:
txt = "The rain in Spain"
x = re.search("Portugal", txt)
print(x)

print('-----')

# функція split(): повертає список, де рядок було розділено на кожному збігу:
txt = "The rain in Spain"
x = re.split("\s", txt)
print(x)

print('-----')

# можна контролювати кількість повторень, вказавши параметр maxsplit
txt = "The rain in Spain"
# maxsplit ЗАВЖДИ указуват явно!!!(зміни у майбутньому у Python!!!)
x = re.split("\s", txt, maxsplit=1)
print(x)

print('-----')

# функція sub(): замінює збіги текстом на вибір користувача:
txt = "The rain in Spain"
x = re.sub("\s", "9", txt)
print(x)

print('-----')

# можна контролювати кількість, вказавши параметр count:
txt = "The rain in Spain"
# count ЗАВЖДИ указуват явно!!!(зміни у майбутньому у Python!!!)
x = re.sub("\s", "9", txt, count=2)
print(x)

print('-----')

# обʼєкт Match - це обʼєкт, що містить інформацію про пошук та результат,
# якщо збігу немає, то замість цього обʼєкту буде повернуто значення None:
txt = "The rain in Spain"
x = re.search("ai", txt)
print(x) # this will print an object

print('-----')

# властивості та методи обʼєкту Match, які використовуються для 
# отримання інформації про пошук та результат:
# .span()   - повертає кортеж,що містить початкову та кінцеву позиції збігу
# .string() - повертає рядок, переданий у функцію
# .group()  - повертає частину рядка, де був збіг

# вивести позицію(початкову та кінцеву)першого збігу:
# буде шукати слова,що починаються з великої літери S:
txt = "The rain in Spain"
x = re.search(r"\bS\w+", txt)
print(x.span())

print('-----')

# вивести рядок, переданий у функцію:
txt = "The rain in Spain"
x = re.search(r"\bS\w+", txt)
print(x.string)

print('-----')

# вивести частину рядка, де було знайдено збіг,регулярний вираз шукає
# будь-які слова, що починаються з великої літери S:
txt = "The rain in Spain"
x = re.search(r"\bS\w+", txt)
print(x.group())

print('-----')

# якщо збігу немає,замість обʼєкта Match буде повернуто значення None.

# task 1: Пошук усіх дат
# Дано текст, у якому зустрічаються дати у форматі РРРР-ММ-ДД 
# (наприклад, 2023-10-25). Напиши функцію, яка витягне всі 
# такі дати у список.
import re
text = "Дедлайн проєкту 2024-05-12,а наступна зустріч запланована на 2024-06-01."
# \d{4} - 4 цифри року, \d{2} - місяць і день
pattern = r"\d{4}-\d{2}-\d{2}"
dates = re.findall(pattern, text)
print(dates) # ['2024-05-12', '2024-06-01']

print('-----')

# task 2: Валідація логіна
# Перевір, чи є нікнейм користувача коректним. Правила: 
# він має містити лише латинські літери, цифри та нижнє 
# підкреслення, довжина — від 3 до 15 символів.
import re
def check_login(login):
    # символи ^ та $ гарантують, що ВЕСЬ рядок відповідає шаблону
    # \w - це [a-zA-Z0-9_]
    pattern = r"^\w{3,15}$"
    if re.fullmatch(pattern, login):
        return "Correct"
    else:
        return "Uncorrect"
    
print(check_login("user_123")) # Correct
print(check_login("admin!")) # Uncorrect

print('-----')

# task 3: Приховування номерів телефонів
# є список контактів, треба приховати частину номера для 
# конфіденційності. Заміни останні 7 цифр номера на зірочки. 
# Формат номера: +380671234567.
import re
phone = "+380671234567"
# шукаємо останні 7 цифр в кінці рядка
pattern = r"\d{7}$"
result = re.sub(pattern, "*******", phone)
print(result) # +38067*******

print('-----')

# task 4: Вилучення цін із тексту
# Знайди в тексті всі суми грошей, які записані у форматі "число + грн".
text = "Хліб коштує 25 грн, молоко 40 грн, а шоколад - 55 грн."
# \d+ - одна або більше цифр
# \s* - нуль або більше пробелів
# грн - саме слово
# ЗАВЖДИ писати шаблон без пробелів!!! інакше помилка!!!)
pattern = r"\d+\s*грн"
prices = re.findall(pattern, text)
print(prices) # ['25 грн', '40 грн', '55 грн']

print('-----')

# task 5: Очищення тексту від HTML-тегів
# є текст із сайту, і в ньому є HTML-теги типу <p>, <b> тощо. 
# Потрібно видалити все, що знаходиться всередині кутових дужок, 
# залишивши лише чистий текст.
import re
html = "<p>Вітаю на <b>нашому</b> сайті!</p>"
# < - початок тегу
# [^>]* - будь-які символи,окрім закриваючої дужки >
# > - кінець тегу
pattern = r"<[^>]*>"
clean_text = re.sub(pattern, "", html)
print(clean_text) # "Вітаю на нашому сайті!"

print('-----')