# Напишіть програму, яка використовує range() для виведення 
# всіх парних чисел від 1 до 20 (включно)
# Починаємо з 2 (перше парне), зупиняємось на 21 
# (щоб включити 20), крок 2
for number in range(2, 21, 2):
    print(number)

print("-----")

# Напишіть функцію, яка приймає ціле число n і використовує 
# range() для обчислення його факторіала (n!)
def factorial(n):
    if n < 0:
        return("Факторіал відʼємного числа не визначений.")
    if n == 0:
        return 1
    result = 1
    # range(1, n + 1) генерує числа від 1 до n включно
    for i in range(1, n + 1):
        result *= i
    return result
number = 5
print(f"\nФакторіал числа {number}: {factorial(number)}")

print("-----")

# Напишіть програму, яка використовує range() для імітації 
# зворотного відліку з 10 до 1, а потім виводить повідомлення 
# "Пуск!". Використовуйте тільки один виклик range()
print("\nЗворотній відлік:")
# # range(start, stop, step)
# Починаємо з 10, зупиняємось на 0 (щоб включити 1), крок -1
for count in range(10, 0, -1):
    print(count)
print("Start!")