# цикл for - це основа для роботи з колекціями та ітерованими об'єктами в Python.
# Він дозволяє виконувати блок коду для кожного елемента в посліідовності.

# task 1
# пряма ітерація по рядку та строкова конкатенація
word = "Python"
reversed_word = ""

# ітеруємося по кожному символу в рядку
for char in word:
    # додаємо символ перед тим, що вже є в reversed_word
    # таким чином ми отримуємо перевернутий рядок
    reversed_word = char + reversed_word
print(f"Reversed word: {reversed_word}.")
print(f"Original word: {word}.")

print("-----")

# task 2
# ефективне використання диапазону range() з параметром кроку
# виведення усіх парнич чисел від 2 до 20 включно
for number in range(2, 21, 2): # починаємо з 2, закінчуємо на 21 (не включно), крок 2
    print(number, end=' ') # виводимо числа в одному рядку, розділені пробілом

print("\n-----")

# task 3
# вкладені цикли (for внутри for)
# створення та виведення піраміди з зірочок
height = 5

# зовнішній цикл для кожного рівня піраміди
for row in range(1, height + 1):
    # внутрішній цикл для виведення зірочок на поточному рівні
    for column in range(row):
        print("*", end='') # виводимо зірочку без переходу на новий рядок
    print() # після завершення внутрішнього циклу переходимо на новий рядок