# Цикл while (поки що) використовується, коли ти не знаєш заздалегідь,
# скільки разів потрібно повторювати дію. Він працює, поки
# умова залишається істинним (True).

# task 1
# простий цикл, що виконується 5 разів
count = 0 # ініціалізуємо змінну лічильника

while count < 5: # умова циклу: поки count менше 5
    print("Hello, world!") 
    count += 1 # зміна: збільшуємо count на 1, щоб цикл завершився

print("-----")

# task 2
# керування циклом через введення користувача
total_sum = 0
number = -1 # початкове значення для входу в цикл

while number != 0: # цикл продовжується, поки number не дорівнює 0
    try:
        number = int(input("Enter a number (0 to stop): ")) # запитуємо число у користувача
        total_sum += number # додаємо введене число до total_sum
    except ValueError:
        # Якщо введене значення не є цілим числом, виводимо повідомлення про помилку
        print("Please enter a valid integer.")  

print(f"Total sum is: {total_sum}.")

print("-----")

# task 3
# змінення внутрішнього стану числа в циклі
num = int(input("Enter a positive integer: "))
count = 0 # лічильник для підрахунку кількості ітерацій

original_num = num # збереження оригінального числа для виведення пізніше

# цикл продовжується, поки num більше 0
while num > 0:
    # оператор цілочисельного ділення на 10 (//)
    # видаляє останню цифру числа
    #наприклад, 123 // 10 дає 12
    num = num // 10

    # збільшуємо лічильник чисел на 1
    count += 1

print(f"The number {original_num} has {count} digits.")

